{
  "projects": [
      {
          "title": "Real-time Fur Deformations for Films",
          "course": "TQME33 - Degree Project - Master's Thesis",
          "year": 5,	
          "duration": "Feb 2019 - Jun 2019",
          "nr_collabs": 0,
          "image_id": "1c_mlpULtsqvsg3xnOdTr225IImtpXW3A",	
          "info": ["Thesis title: Real-time Fur Deformations for Film-Quality Characters", "In my thesis, the goal was to get a production ready fur groom to deform with the underlying subdivided and animated surface in real-time. The thesis investigated how to import a fur groom into Unity, how to render it, how to deform it and how to remove the most obvious of artefacts.", "When it came to rendering the fur, two different methods were investigated: rendering it as poly lines and as view facing triangle strips. Rendering the fur as view facing triangle strips was proven to be slower but the visual quality was a lot better. The deforming of the fur was done as transformations following the underlying subdivided surface. The subdivision of the surface was done using the open-source project OpenSubdiv which was found to be a very helpful tool when finding the hair strands positions on the surface. The methods of volumetric velocity smoothing together with Extended Position Based Dynamics were used to add hair-to-hair interactions and to simulate the stiffness of the fur. This removed artefacts of when for example bending an arm or a leg and the hair crashed into each other at the cost of performance.", "The performance of having 0.9 million hairs, built using 10.2 million hair vertices, deforming with the underlying surface was measured to be around 10ms depending on the way it was chosen to be rendered. Adding hair-to-hair interactions to that dragged the performance down to 332ms.", "As a conclusion, having a production ready fur groom deform with the underlying surface in real-time is possible. The hair-to-hair interactions part looks promising but will need further improvements and investigations to work in real-time for characters with a lot of fur.", "During my thesis I worked with the Virtual Production team at Moving Picture Company (MPC) in London. It was an amazing experience!"],	
          "skills_developed": "HLSL, C#, Unity",
          "type": "type-graphics",	
          "movie": "",	
          "homepage": "",
          "github": ""
      },
      {
          "title": "LEGO", 
          "course": "TNMK30 - Electronic Publishing", 
          "year": 1, 
          "duration": "Nov 2014 – Jan 2015",
          "nr_collabs": 3, 
          "image_id": "1oaMq4Spn9cj4wFsAE5exo_f92qWGMI-7", 
          "info": ["Electronic publishing, year one, is the introduction course to web programming. The project of the course was to make a website with the help of a LEGO database, where the user would be able to search for Lego sets and see which pieces it contained, and some brief information about the kit."], 
          "skills_developed": "HTML, CSS, JavaScript, PHP, MySQL",
          "type": "type-webb", 
          "movie": "", 
          "homepage": "", 
          "github": ""
      }
  ]
}